var a = '문자열은 작은따옴표로 둘러싸면 됩니다.';
var b = "큰따옴표도 문자열을 표현할 수 있습니다.";

var c = "큰따옴표 문자열에는 작은따옴표'를 사용할 수 있습니다.";
var d = '작은따옴표 문자열에는 큰따옴표 "를 사용할 수 있습니다.';


var e = "작은 따옴표를 쓰고 싶다면 \'이렇게\' 사용하면 됩니다. 마찬가지로 \"큰따옴표\"도 쓸 수 있습니다."
var f = '작은 따옴표를 쓰고싶다면 \'이렇게\' 사용하면 됩니다. 마찬가지로 \"큰따옴표\"도 쓸 수 있습니다.'


var g = "\\ 문자를 쓰고 싶다면 역슬래시 두번 씁니다."

var h = "문자열에서 줄 바꿈을 하고 싶다면 \n 역슬래시 n을 사용합니다."
var i = a + b;
var j = "abcde" ;

// • 작은따옴표나 큰따옴표로 감싸서 문자열을 표현할 수 있습니다.
// • 문자열 중간에 작은따옴표와 큰따옴표를 활용하려면 이스케이프 문자를 활용합니다.
// • 이스케이프 문자는 역슬래시를 사용합니다.
// • 문자열 중간에 작은따옴표를 쓸 때는 </span>‘를 사용합니다.
// • 문자열 중간에 큰따옴표를 쓸 때는 </span>“를 사용합니다.
// • 문자열 중간에 역슬래시를 사용할 때는 \를 사용합니다.
// • 문자열 중간에서 줄 바꿈을 할 때는 </span>n을 사용합니다.